# AddOpening Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCreationData..::..AddOpening Method
IFCExtrusionCreationData Class See Also
---
Adds an opening to the data.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void AddOpening(
	IFCExtrusionData data
)
```

Visual Basic
---
```text
Public Sub AddOpening ( _
	data As IFCExtrusionData _
)
```

Visual C++
---
```text
public:
void AddOpening(
	IFCExtrusionData^ data
)
```

# ### Parameters
data
    Type: Autodesk.Revit.DB.IFC..::..IFCExtrusionData The opening.
# Remarks
The opening is stored for retrieval later via GetOpenings().
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace